tg-bot/ШаблонБота/src/Documents/РеализацияМерча/РеализацияМерча.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияМерча</name>
  <registerRecords>AccumulationRegister.ОстаткиМерча</registerRecords>
  <registerRecords>AccumulationRegister.БалансПользователя</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМерча</types>
    </type>
  </attributes>
</mdclass:Document>

tg-bot/ШаблонБота/src/AccumulationRegisters/ОстаткиМерча/ОстаткиМерча.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМерча</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМерча</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

tg-bot/ШаблонБота/src/Enums/ТипВознаграждения/ТипВознаграждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипВознаграждения</name>
  <enumValues>
    <name>Золото</name>
  </enumValues>
  <enumValues>
    <name>Серебро</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/Documents/РеализацияМерча/ManagerModule.bsl
Функция ВыдатьМерчФизЛицу(Мерч, ФизическоеЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиМерчаОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиМерчаОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиМерча.Остатки(&МоментВремени, ) КАК ОстаткиМерчаОстатки
	               |ГДЕ
	               |	ОстаткиМерчаОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(ТекущаяДата(), ВидГраницы.Включая);
//	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат("Нет мерча");
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.КоличествоЗолото КАК КоличествоЗолото,
	               |	ФизическиеЛица.КоличествоСеребро КАК КоличествоСеребро
	               |ИЗ
	               |	Документ.РеализацияМерча КАК РеализацияМерча
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО РеализацияМерча.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	РеализацияМерча.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗолотоЛицо = Выборка.КоличествоЗолото;
		СереброЛицо = Выборка.КоличествоСеребро;
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураМерча.Цена КАК Цена,
	               |	НоменклатураМерча.ТипВознаграждения КАК ТипВознаграждения
	               |ИЗ
	               |	Справочник.НоменклатураМерча КАК НоменклатураМерча
	               |ГДЕ
	               |	НоменклатураМерча.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Мерч);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипВознаграждения = Перечисления.ТипВознаграждения.Золото И ЗолотоЛицо < Выборка.Цена Тогда
			Возврат ("Нет золота");
		ИначеЕсли Выборка.ТипВознаграждения = Перечисления.ТипВознаграждения.Серебро И СереброЛицо < Выборка.Цена Тогда 	
			Возврат ("Нет серебра");
		КонецЕсли;	
	КонецЦикла;
	
	Возврат ("Куплено");

КонецФункции
